Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Other digital technology used by the kindergartens included cameras, printers, scanners, camcorders and the like.
nb: Annen digital teknologi barnehagene tok i bruk, var fotoapparat, skriver, skanner, videokamera og lignende.

source: This involves using subject terminology in dialogue, conversations and oral presentations.
nb: Det innebærer å bruke fagbegreper i dialog, samtaler og muntlige presentasjoner.

source: Based on the Scottish model Getting it Right for Every Child (GIREC), they perform ambitious reform work in developing a child-centred model for cross-sectoral and coherent follow-up of vulner-able children and families.
nb: Evalueringen gir ikke entydige svar på hvorfor det er slik, men det er nærliggende å anta at ulik faglig bakgrunn, kompetanse, og ulikt erfarings og -kunnskapsgrunnlag, er blant faktorene som innvirker på sensorenes vurderinger.

source: ‘The employees had poor work posture in tight spaces, and they leaned over to clean small toilets.
nb: – De ansatte sto i dårlige arbeidsstillinger i trange rom og vasket små toaletter.

source: My job was to determine how this worked in actual practice’, recounts the researcher Maiken Marie Jordal.
nb: Min oppgave var å se på hvordan dette fungerte i en praktisk sammenheng, sier forskeren Maiken Marie Jordal.

source: The school and apprenticeship-training enter-prise shall ensure that the pupils gain experience of different types of participation and empowerment in democratic processes in their day-to-day activities and through participation in representative bodies.
nb: Skolen og lærebedriften skal legge til rette for at elevene får erfaring med ulike former for deltakelse og medvirkning i demokratiske prosesser både i det daglige arbeidet og ved deltakelse i representative organer.

source: Customer handling and cost estimates are included in the subject.
nb: Kundebehandling og kostnadsberegning er en del av faget.

source: By seeing Norwegian language and culture in a historical and national perspective, the pupils can gain a better understanding of the society they live in.
nb: I tillegg skal faget stimulere til utvikling av gode læringsstrategier og evne til kritisk tenkning og motivere til utvikling av lese- og skrivelyst og gode lese- og skrivevaner.

source: It also involves developing an increasing awareness of the new digital tools that exist for learning in the subject of Mathematics.
nb: Videre innebærer det å bli stadig mer oppmerksom på den nytten digitale verktøy har for læring i matematikkfaget.

source: History makes people, and people make history.
nb: Mennesker er historieskapte og historieskapende.

source: understand various oral and written presentations on self-selected topics
nb: uttrykke seg for å få hjelp til å forstå og bli forstått i ulike situasjoner

source: Curriculum for the elective subject of Democracy in practice (DIP1-01)
nb: Læreplan i valgfaget demokrati i praksis (DIP1-01)

source: Technology and theory of research - programme subject in programmes for Specialization in General Studies (TNF1-01)
nb: Læreplan i teknologi og forskningslære - programfag i utdanningsprogram for studiespesialisering (TNF1-01)

source: When a child is sad or frustrated, many kindergarten employees are not sure whether they should intervene.
nb: Når barn er triste eller frustrerte, er mange av de ansatte i barnehagen usikre på når de skal gripe inn.

source: identify basic differences between the political parties in Norway and argue from different political viewpoints
nb: identifisere grunnleggende forskjeller mellom politiske partier og grupperinger i samisk og i norsk politikk og argumentere fra ulike politiske ståsteder

source: describe the construction and function of facilities for egg, brood, table fish, algae and shellfish production
nb: beskrive oppbygning og funksjon av anleggstyper for egg-, yngel-, matfisk-, alge- og skalldyrproduksjon

source: Writing in RLE also involves encountering different kinds of written aesthetic forms of expression, and making use of these.
nb: Skriving i KRL innebærer også å møte ulike estetiske skriftuttrykk og gjøre bruk av dem.

source: use digital and other aids in his/her own language learning
nb: bruke digitale og andre hjelpemidler i egen språklæring

source: Teaching shall help the individual develop practical skills, technical insight and an ability to make independent assessments.
nb: Opplæringen skal bidra til at den enkelte utvikler praktiske ferdigheter, faglig innsikt og evne til selvstendige vurderinger.

source: how human rights and the rights of indigenous peoples, as well as other international treaties and international cooperation, are important for national policies, people’s lives, equal rights and equality
nb: hvordan menneske- og urfolksrettigheter og andre internasjonale avtaler og samarbeid har betydning for nasjonal politikk, menneskers liv og likestilling og likeverd

source: identify common plants in different types of facilities and use plant material based on physiological and environmental requirements
nb: identifisere vanlige planter i ulike anleggstyper og bruke plantemateriale ut fra fysiologi og miljøkrav

source: Social economics comprises two programme subjects: Social economics 1 and Social economics 2.
nb: Samfunnsøkonomi består av to programfag: samfunnsøkonomi 1 og samfunnsøkonomi 2.

source: For example, 27 per cent of the children responded that they could say no to an activity outdoors, while only 12 per cent said the same about indoor activities.
nb: For eksempel oppga 27 prosent av barna at de kunne si nei til en aktivitet ute, mens bare 12 prosent sa det samme om inneaktiviteter.

source: describe and explain natural and cultural landscapes in the local community
nb: gjøre rede for samiske benevnelser på landskapsformer og samiske stedsnavn

source: To develop their skills pupils must read much and often, and they must work systematically on reading strategies appropriate to the objective of the reading, and on different types of texts in the subject.
nb: Å kunne avlese omfatter både å kunne finne informasjon i ulike tekster, å lære fag og å oppleve og oppfatte resonnementer og framstillinger i et bredt spekter av tekstformer.

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring and solving problems related to numeracy strategies and their competence in communication using mathematical terminology.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i utforsking og problemløsing knyttet til regnestrategier og kompetansen sin i kommunikasjon med matematiske begreper.

source: define key terms related to socialization and use them to compare socialization in different cultures
nb: definere sentrale begreper knyttet til sosialisering og bruke dem til å sammenlikne sosialisering i ulike kulturer

source: Since 2016 the kindergarten has been connected to OsloMet through a research and development project, more precisely the innovative project “Utdanningsbarnehager”.
nb: Siden 2016 har barnehagen vært knyttet til OsloMet i et forsknings- og utviklingssamarbeid, nærmere bestemt innovasjonsprosjektet «Utdanningsbarnehager».

source: Practicing critical and varied use of sources to reach substantial conclusions with an increasingly more extensive vocabulary and increasing awareness of social science themes are central parts of the process.
nb: Oppøving i kritisk og variert kildebruk, i å kunne trekke grunngitte konklusjoner med økende bruk av fagbegreper og stigende refleksjon omkring temaer, er en sentral del av prosessen.

source: find examples of different types of conflicts and human rights violations and discuss and elaborate on what the United Nations and other international operators can do
nb: finne eksempler på ulike typer konflikter og menneskerettighetsbrudd og drøfte hva FN og andre internasjonale aktører kan gjøre

source: strip down and assemble different engine components and explain their construction and how they work
nb: demontere og montere ulike motorkomponenter og forklare oppbygning og virkemåte

source: explain and calculate using price indices, currency values, real wages and nominal wages, and calculate income, taxes and charges
nb: gjøre rede for og regne med prisindeks, kroneverdi, reallønn og nominell lønn og beregne inntekt, skatt og avgifter

source: in Aquaculture involves using numbers in calculation to find volumes, areas, biomass, growth-rate and density.
nb: i akvakultur innebærer å bruke tall i beregninger for å finne volum, areal, lengde, vekt, biomasse, vekst og tetthet.

source: Staff members also fussed over the girls more than the boys.
nb: De ble mer dullet med av personalet enn guttene.

source: use reading strategies and textual knowledge in a result-oriented manner for learning
nb: forstå og samtale om tegnspråktekster for barn

source: This may be relevant for students enrolled in special education, for example.
nb: Bruk av offentlig transport til og fra skolen begrenses der det er mulig.

source: use tools from theories of culture and communication in analyzing different cultures in a contemporary perspective
nb: bruke redskaper fra kultur- og kommunikasjonsteorier i analyse av ulike kulturelle ytringer fra egen samtid

source: Cooperation between parents and kindergarten teachers can sometimes be problematic.
nb: Samarbeidet mellom foreldre og barnehagelærere blir av og til problematisert.

source: assess their own texts and those created by others based on technical criteria
nb: bruke digitale verktøy til å analysere egne og andres tegnspråktekster

source: elaborate on the definitions of sine, cosine and tangent and use trigonometry to calculate length, angles and area of triangles
nb: gjøre rede for definisjonene av sinus, cosinus og tangens og bruke trigonometri til å beregne lengder, vinkler og areal i vilkårlige trekanter

source: In a world with increasing mobility and digital interaction, competence in several languages and intercultural competence are prerequisites for successful communication and participation in many areas.
nb: Opplæringen skal legge til rette for faglig fordypning og bidra til identitetsutvikling, videreutvikling av språklig og kulturell kompetanse i samisk og motivere til kommunikasjon og samarbeid på tvers av språkgrenser innenfor Sápmi.

source: Yet Norway’s new Framework Plan for Kindergartens does not mention the term.
nb: I Norge, i den nye rammeplanen for barnehagen, omtales ikke begrepet.

source: But if you are responsible for few children, it’s easier to answer questions, contribute in conflicts and keep an eye on a child’s initiative.”
nb: Men hvis du har ansvar for noen få barn, har du bedre mulighet til å svare spørsmål, hjelpe til i konflikter og følge barnas initiativ.

source: natural resources and assess the significance of this for people and a sustainable societyLæreplan i historie – fellesfag i studieforberedende
nb: revolusjonen til i dag har endret menneskers liv og formet forventninger til framtidenLæreplan i historie – fellesfag i studieforberedende

source: recognise Christian art and make use of aesthetic expressions related to Christianity
nb: gjenkjenne kunst og gjøre bruk av estetiske uttrykk knyttet til kristendommen

source: Numbers includes whole numbers, fractions, decimal numbers and percentages.
nb: Området tall omfatter både hele tall, brøk, desimaltall og prosent.

source: What factors may promote better coordination and collaboration?
nb: Kommunen skal i tillegg til driftstilskuddet gi et påslag for administrasjonskostnader.

source: In the natural science subject the basic skills are understood as follows:
nb: I naturfag forstås grunnleggende ferdigheter slik:

source: It is easy for the adult, who sees only crying Anna’s red hand, to tell Bjørn that it was wrong of him to bite her.
nb: Det er lett for den voksne, som nå bare ser den gråtende Annas røde hånd, å si til Bjørn at det var galt av ham å bite henne.

source: The teaching in basic Norwegian shall cover the instruction in reading and writing and help develop pupils’ vocabulary and grasp of concepts in a variety of subjects.
nb: Opplæringen i grunnleggende norsk skal ivareta lese- og skriveopplæringen og bidra til å utvikle elevenes ordforråd og begrepsforståelse i ulike fag.

source: About the virus, illness and infection
nb: Om viruset, sykdommen og utbruddet

source: The main subject area of Oral communication involves listening to and producing statements in Sign Language in interaction with others and being part of a linguistic community.
nb: dreier seg om muntlig kommunikasjon, det vil si å lytte aktivt til, produsere og utforske tegnspråklige ytringer i en samhandlingssituasjon.

source: The head teacher for the Guovssahas kindergarten is pleased that more Sámi children in Tromsø are now learning to express what is in their hearts.
nb: Faglederen for Guovssahas barnehage er glad for at flere samiske barn i Tromsø nå lærer å uttrykke seg gjennom hjertet.

source: The main area of communication focuses on using the English language to communicate.
nb: Hovedområdet skriftlig kommunikasjon dreier seg om å forstå og bruke det engelske språket ved å lese og skrive og å bruke hensiktsmessige lese- og skrivestrategier.

source: Fig. 2.10 Percentage of mathematics teachers (3MX in Norway) who stated that they have mathematics and/or mathematic education as major or main areas of study
nb: Figur 2.10 Prosentandelen av lærerne i matematikk (3MX i Norge) som oppgir at de har fordypning i matematikk og/eller matematikkdidaktikk.

source: If a pupil applies for exemption from part of ordinary education based on the provisions laid down in Section 2-3(a) of the Norwegian Education Act, then another form of adapted education shall take its place.
nb: Dersom eleven har fritak fra deler av den ordinære opplæringen i henhold til opplæringslovens § 2-3 a, skal det følges opp med tilpasset opplæring.

source: talk about family customs in everyday life and holidays that are common for religions and philosophies of life
nb: samtale om familieskikker i hverdag og høytid på tvers av religioner og livssyn

source: Through exercising computational skills, with and without digital aids, a basic and necessary competence for advanced mathematics is developed.
nb: Gjennom trening av regneferdigheter, både med og uten digitale hjelpemidler, utvikles et grunnlag og en nødvendig kompetanse for videre arbeid med matematikk.

source: read a representative selection of contemporary texts, fiction and non-fiction, in Bokmål and Nynorsk and in translation from Sami and then reflect on their content, form and purpose
nb: lese et representativt utvalg samtidstekster, skjønnlitteratur og sakprosa, på bokmål og nynorsk og i oversettelse fra samisk, og reflektere over innhold, form og formål

source: Sarabakken, who used to work at a Norwegian kindergarten, makes it clear that the Sámi have developed their own educational theory.
nb: Sarabakken, som har jobbet i en norsk barnehage tidligere, er klar på at det finnes en egen samisk pedagogikk.

source: Children who are recognized for their knowledge and competence, will appear as well-informed and exciting persons.
nb: Barn som ofte anerkjennes av de ansatte for sin kunnskap og kompetanse, vil framstå som kunnskapsrike og spennende aktører.

source: These are working methods which have the particular objective of developing solid concepts and problem-solving strategies by students (Cobb, Boufi, McClain, & Whitenack, 1997).
nb: Dette er arbeidsmåter som spesielt tar sikte på å utvikle gode begreper og problemløsingsstrategier hos elevene (Cobb, Boufi, McClain, & Whitenack, 1997).

source: write literary and rhetorical analyses, creative texts and expository texts based on subject-related texts
nb: skrive litterære tolkninger og retoriske analyser, kreative tekster og resonnerende tekster med utgangspunkt i norskfaglige tekster

source: talk about the relationship between image and text in specific composite texts
nb: samtale om sammenhengen mellom bilde og tekst i enkle sammensatte tekster

source: present technical material orally, in writing, or in the form of composite texts
nb: presentere fagstoff muntlig, skriftlig eller i form av sammensatte tekster

source: present different forms of expression from art and music related to Islam
nb: presentere ulike uttrykk fra kunst og musikk knyttet til islam

source: mathematics, reading and writing.
nb: for å kunne tilpasse opplæringa.

source: explain grammatical characteristics of the Norwegian language compared to other languages
nb: bruke ord og uttrykk knyttet til tradisjonelt og moderne yrkesliv og foreslå og vurdere nye termer

source: describe and interpret graphic representations of statistics and other data
nb: beskrive og tolke grafiske representasjoner av tall og andre data

source: For each of the mapping tests, guideline material has been devised that explains how
nb: I sluttrapportene fra skoleeierne sier et stort flertall at de ønsker nasjonale kjennetegn,og at de må være veiledende.

source: carry out work in line with relevant regulations for preventive health work, animal welfare and hygiene
nb: utføre arbeid i tråd med gjeldende regelverk for forebyggende helsearbeid, dyrevelferd og hygiene

source: Covid-19 is caused by the SARS-CoV-2 virus, also referred to as the coronavirus.
nb: Covid-19 forårsakes av viruset SARS-CoV-2, kalt koronavirus.

source: It examines the political parties and what can threaten a democracy.
nb: Det handler om de politiske partiene og grupperinger og hva som kan true demokratiet.

source: ‘Children like numbers and counting.
nb: – Barn er opptatt av tall og telling.

source: relate Siddhartha Gautama's life and his awakening as the Buddha
nb: fortelle om Siddhartha Gautamas liv og hans oppvåkning som Buddha

source: There are now more Sámi living in Tromsø than in the Sámi town of Karasjok.
nb: I Tromsø bor det nå flere samer enn det gjør på det samiske tettstedet Karasjok.

source: use the most basic English phonology and language rhythms through practical-aesthetic forms of expression
nb: bruke de mest grunnleggende engelske språklyder og språkrytmer gjennom praktiskestetiske uttrykksmåter

source: understanding of culture, and learn to appreciate why people make different choices.
nb: Matlaging og måltider er sosiale arenaer for utforsking, samarbeid og samskaping.

source: use symbolism and colours to express emotions and opinions in their own work
nb: og bruke symbolikk og farge til å uttrykke følelser og meninger i egne arbeider

source: The programme subject shall give pupils insight into this field, giving them a better grasp of international environmental debates and discussions on sustainable development.
nb: Programfaget skal gi innsikt i dette feltet, og bidra til at den enkelte kan forstå og følge internasjonale miljødebatter og diskusjoner om bærekraftig utvikling.

source: The teaching shall advance knowledge and skills relating to the construction, mode of operation and maintenance of the most commonly used machines and equipment.
nb: Opplæringen skal fremme kunnskaper og ferdigheter knyttet til konstruksjon, virkemåte og vedlikehold av de mest brukte arbeidsmaskinene og det mest brukte utstyret.

source: present topics from the Norwegian subject curriculum with the ability to critically review what is presented
nb: sammenligne samiske og andre urfolks tekster og vurdere tekstenes betydning for kultur- og identitetsutvikling

source: Good collaboration between municipalities and the county municipalities must be facilitated in order to
nb: Skolehelsetjenesten skal være tilgjengelig på grønt, gult og rødt tiltaksnivå for å kunne følge opp barn og

source: draw shapes and depth using techniques such as overlapping and reduction
nb: tegne form og dybde ved bruk av virkemidler som overlapping og forminskning

source: Eide and Os say that many of the most successful circle times include elements of suspense added by the adults.
nb: Eide og Os forteller at i mange av de mest vellykkede samlingsstundene har de voksne lagt inn spenningsmomenter.

source: In another article Nome describes how the children use sounds, rhythms and movements in their social interaction.
nb: I en annen artikkel beskriver Nome hvordan barna bruker lyd, rytmer og bevegelse i det sosiale samspillet.

source: Moreover, care is not being well documented.
nb: Omsorg ble heller ikke godt dokumentert.

source: convert between different representations of functions
nb: oversette mellom ulike representasjoner av funksjoner

source: Reform Group have shown that assessment can have both
nb: Funn frå forskingsarbeidet til Assessment Reform Group har

source: They can just stick them out and capture…’.
nb: Den kan bare strekke den ut og fange…

source: Westerwille, OH: National Middle School Association. Epstein, J.L. & Dauber, S.L. (1991).
nb: Det synes viktig at læreren jobber med foreldresamarbeid som en integrert del av sin øvrige undervisningspraksis (Epstein & Dauber, 1991).

source: explain the main features of Roman Catholic, Orthodox and Protestant traditions
nb: forklare hovedtrekk ved romersk-katolsk, ortodoks og protestantisk kristendomstradisjon

source: Aquaculture and the environment 140 teaching hours per year Basic skills
nb: Oppdrett og miljø 140 årstimer Grunnleggende ferdigheter

source: The main subject area is concerned with how rock types and land forms are created.
nb: Hovedområdet handler om hvordan bergarter og landformer dannes.

source: talk about the relationship between speech and written language
nb: samtale om forholdet mellom tale og skriftspråk

source: in Marketing and management involves describing, explaining and reflecting on subject area themes.
nb: i markedsføring og ledelse innebærer å beskrive, forklare og reflektere over faglige temaer.

source: and discuss the purpose of this use of history
nb: gjøre rede for tanker og ideologier som har ligget til grunn for politiske

source: interpret and use formulas that apply to day-to-day life and working life
nb: tolke og bruke formler som gjelder dagligliv og yrkesliv

source: ‘We practice “learning by doing” to some extent, and we’re not afraid to let the children learn by trial and error.
nb: – Vi praktiserer litt «learning by doing» og er ikke redde for å la barna prøve og feile.

source: find examples of events that have shaped the history of a non-European country after 1900, and reflect on how the country might have developed if these events had not taken place
nb: finne eksempler på hendelser som har formet et ikke-europeisk lands historie etter 1900, og reflektere over hvordan landet kunne ha utviklet seg hvis disse hendelsene ikke hadde funnet sted

source: analyse the challenges facing the welfare state and discuss the role of the welfare state in the future
nb: analysere velferdsstatens utfordringer og diskutere velferdsstatens rolle i framtida

source: describe the interaction between oral and written language, images, sounds and music, movement, graphics and design, and show the relationship between content, form and purpose
nb: tolke og vurdere samspillet mellom muntlig og skriftlig språk, bilder, lyd og musikk, bevegelse, grafikk og design og vise sammenhengen mellom innhold, form og formål

source: implement periodic and preventive maintenance of machines and equipment
nb: utføre periodisk og forebyggende vedlikehold av maskiner og utstyr

source: Means of competition
nb: marked og målgrupper

source: explore and describe symmetry in patterns and carry out congruent
nb: utforske og beskrive symmetri i mønstre og utføre
